catbase = {
    'Алексей Егоров': {
        'Мартин': 5,
    },
    'Анна Самохина': {
        'Фродо': 3,
    },
    'Андрей Белов': {
        'Вася': 4,
        'Матильда': 8,
    },
    'Игорь Бероев': {
        'Муся': 7,
        'Изольда': 2,
    },
    'Марина Апраксина': {
        'Снейп': 1,
        'Снежок': 3,
    },
    'Виталий Соломин': {
        'Лютик': 4,
        'Барсик': 2,
    },
    'Сергей Колесников': {
        'Марта': 5,
    },
    'Алена Федорова': {
        'Буся': 12,
    },
    'Игорь Андропов': {
        'Джонни': 10,
    },
    'Даниил Невзоров': {
        'Мурзик': 1,
    },
    'Владимир Медведев': {
        'Рыжик': 7,
    },
    'Александр Березуев': {
        'Гарфилд': 3,
    }
}


def main():
    name: str = input('Введите имя владельца: ')
    final_cats: str = ''
    cats = catbase.get(name, "Ни одного животного не найдено")
    if type(cats) is dict:
        for pets_name, age in cats.items():
            final_cats += f'{pets_name}, {age}; '
        final_cats = final_cats[:-2]
    else:
        final_cats = cats
    print(f'{name}: {final_cats}')


if __name__ == '__main__':
    main()
